Identifier: multitenant-jamf-tools.jamf.DownloadAdvancedComputerSearchList
MinimumVersion: "2.3"
Input: {}

Process:
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfObjectReader
    Arguments:
      list_only: True
      object_type: advanced_computer_search
      output_dir: /Users/Shared/Jamf/JamfUploader
